app/views/tenants/edit.html.erb

  </div>
  <% if @tenant.payment.blank? %>
---
SELECT  "payments".* FROM "payments" WHERE "payments"."tenant_id" = ? LIMIT ?  [["tenant_id", 1], ["LIMIT", 1]]