app/views/projects/users.html.erb

SELECT  "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = ? AND "user_projects"."project_id" = ? LIMIT ?  [["user_id", 2], ["project_id", 1], ["LIMIT", 1]]
SELECT "tenants".* FROM "tenants" INNER JOIN "tenants_users" ON "tenants"."id" = "tenants_users"."tenant_id" WHERE (tenants.tenant_id IS NULL) AND "tenants_users"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE (users.tenant_id IS NULL) AND "user_projects"."project_id" = ?  [["project_id", 1]]
---
          <% if !project_user.is_admin? %>
            <%= link_to "Remove", user_project_path(project_user.user_projects.find_by(project_id: @project.id),
                tenant_id: @project.tenant_id), :method => :delete, :data => {:confirm => t('.confirm', :default => t("helpers.links.confirm",
                :default => 'Are you sure?'))}, :class => 'btn btn-xs btn-danger' %>