app/controllers/artifacts_controller.rb

  def create
    @artifact = Artifact.new(artifact_params)

    respond_to do |format|
      if @artifact.save
---
INSERT INTO "artifacts" ("name", "key", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)