app/controllers/confirmations_controller.rb

SELECT  "users".* FROM "users" WHERE (users.tenant_id IS NULL) AND "users"."confirmation_token" = ? ORDER BY "users"."id" ASC LIMIT ?  [["confirmation_token", "y_F_WzqpLczG3da4xzi9"], ["LIMIT", 1]]
---
  def set_confirmable()
    @confirmable = User.find_or_initialize_with_error_by(:confirmation_token, params[:confirmation_token])