app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    @project.users << current_user
---
INSERT INTO "user_projects" ("project_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["project_id", 1], ["user_id", 1], ["created_at", "2019-11-07 16:45:05.027823"], ["updated_at", "2019-11-07 16:45:05.027823"]]

  def destroy
    @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]

  def users
    @project_users = (@project.users + (User.where(tenant_id: @tenant.id, is_admin: true))) - [current_user]
---
SELECT "users".* FROM "users" INNER JOIN "tenants_users" ON "users"."id" = "tenants_users"."user_id" WHERE (users.tenant_id IS NULL) AND "tenants_users"."tenant_id" = ? AND "users"."is_admin" = ?  [["tenant_id", 1], ["is_admin", "f"]]

  def add_user
    @project_user = UserProject.new(user_id: params[:user_id], project_id: @project.id)

    respond_to do |format|
      if @project_user.save
---
INSERT INTO "user_projects" ("project_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["project_id", 1], ["user_id", 2], ["created_at", "2019-11-07 16:47:51.766956"], ["updated_at", "2019-11-07 16:47:51.766956"]]

    def set_project
      @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_tenant
      @tenant = Tenant.find(params[:tenant_id])
---
SELECT  "tenants".* FROM "tenants" WHERE (tenants.tenant_id IS NULL) AND "tenants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]