app/controllers/registrations_controller.rb

  def create
      # have a working copy of the params in case Tenant callbacks
      # make any changes
    tenant_params = sign_up_params_tenant
    user_params   = sign_up_params_user.merge({is_admin: true})
    coupon_params = sign_up_params_coupon

    sign_out_session!
       # next two lines prep signup view parameters
    prep_signup_view( tenant_params, user_params, coupon_params )

       # validate recaptcha first unless not enabled
    if !::Milia.use_recaptcha  ||  verify_recaptcha

      Tenant.transaction  do
        @tenant = Tenant.create_new_tenant( tenant_params, user_params, coupon_params)
        if @tenant.errors.empty?   # tenant created

          if @tenant.plan == 'premium'
            @payment = Payment.new({email: user_params["email"], token: params[:payment]["token"], tenant: @tenant})
            flash[:error] = "Please check registration errors" unless @payment.valid?
            begin
              @payment.process_payment
              @payment.save
            rescue Exception => e
              flash[:error] = e.message
              @tenant.destroy
---
INSERT INTO "tenants" ("name", "created_at", "updated_at", "plan") VALUES (?, ?, ?, ?)  [["name", "Test Org LLC"], ["created_at", "2019-11-06 23:24:04.936348"], ["updated_at", "2019-11-06 23:24:04.936348"], ["plan", "premium"]]
INSERT INTO "users" ("email", "encrypted_password", "confirmation_token", "confirmation_sent_at", "skip_confirm_change_password", "created_at", "updated_at", "is_admin") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "payments" ("email", "token", "tenant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "john@example.com"], ["token", "tok_1FbxuTKcq08y3n4bYsymbmex"], ["tenant_id", 3], ["created_at", "2019-11-06 23:27:34.475998"], ["updated_at", "2019-11-06 23:27:34.475998"]]
DELETE FROM "tenants" WHERE "tenants"."id" = ?  [["id", 2]]