app/controllers/tenants_controller.rb

UPDATE "tenants" SET "plan" = ?, "updated_at" = ? WHERE "tenants"."id" = ?  [["plan", "premium"], ["updated_at", "2019-11-07 15:23:22.870715"], ["id", 1]]
SELECT  "payments".* FROM "payments" WHERE "payments"."tenant_id" = ? LIMIT ?  [["tenant_id", 1], ["LIMIT", 1]]
INSERT INTO "payments" ("token", "tenant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["token", "tok_1FcCpSKcq08y3n4bRJikqWZy"], ["tenant_id", 1], ["created_at", "2019-11-07 15:23:24.110091"], ["updated_at", "2019-11-07 15:23:24.110091"]]
---
  def update
    respond_to do |format|
      Tenant.transaction do
        if @tenant.update(tenant_params)
          if @tenant.plan == "premium" && @tenant.payment.blank?
            @payment = Payment.new({email: tenant_params["email"],
                                    token: params[:payment]["token"], tenant: @tenant})
            begin
              @payment.process_payment
              @payment.save

SELECT  "tenants".* FROM "tenants" WHERE (tenants.tenant_id IS NULL) AND "tenants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_tenant
    @tenant = Tenant.find(Tenant.current_tenant_id)