app/controllers/user_projects_controller.rb

DELETE FROM "user_projects" WHERE "user_projects"."id" = ?  [["id", 4]]
---
  def destroy
    @user_project.destroy

SELECT  "user_projects".* FROM "user_projects" WHERE "user_projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_user_project
      @user_project = UserProject.find(params[:id])